{
  "articles": [
    {
      "title": "User story",
      "headCategory": "Analyse",
      "subCategory": "Gebruikersinteractie",
      "author": {
        "fullName": "Ruben van den Brink",
        "organization": "Hogeschool Utrecht",
        "link": "hogeschool-utrecht"
      },
      "text": "<h2>Onderwerp (What) 11</h2><div><table class=\"highlight tab-size js-file-line-container\" data-tab-size=\"8\" data-paste-markdown-skip=\"\"><tbody><tr><td id=\"LC74\" class=\"blob-code blob-code-inner js-file-line\"><p>Een user story is een korte beschrijving (story) van wat een gebruiker (user) wil. User stories worden gebruikt bij het ontwikkelen van software of producten. Een user story bestaat uit enkele zinnen gewone spreektaal van de (computer)gebruiker waarin staat wat de gebruiker doet of moet doen, als onderdeel van z'n werk. User stories worden gebruikt binnen agile software development als een manier om de requirements te beschrijven. Hierin zegt men 'wie', 'wat', 'waarom' wil. Het geheel is weinig gedetailleerd en moet passen op een post-it. Het is de belangrijkste manier waarop de gebruiker invloed heeft op de functionaliteit van het te ontwikkelen systeem of product. User stories kunnen ook door ontwikkelaars geschreven worden om niet-functionele eisen vast te leggen bijvoorbeeld op het gebied van beveiliging, kwaliteit en performance, maar de eerstverantwoordelijke voor de verzameling van de user stories is de producteigenaar.</p><h2>Voorbeelden</h2><div>Als een gebruiker wil ik mijn klanten kunnen zoeken zowel op voornaam als op achternaam.<br><br>Als een administrator wil ik accounts kunnen verwijderen.<br><br>Als een administrator wil ik nieuwe accounts kunnen aanmaken.<br></div><div><br></div><h2>Gebruik</h2><div>User stories worden gebruikt bij veel agile ontwikkelingsmethoden zoals XP (Extreme Programming) en Scrum. User stories bepalen wat er wordt gemaakt bij softwareprojecten. Door de gebruiker / productowner / klant worden de user stories op volgorde van belangrijkheid gesorteerd, vervolgens worden ze in taken uitgesplitst en van meer exacte tijdsschattingen voorzien door de ontwikkelaars.&nbsp;<br></div></td></tr></tbody></table></div>",
      "description": "Onderwerp (What) 11. Een user story is een korte beschrijving (story) van wat een gebruiker (user) wil. User stories worden gebruikt bij het ontwikkelen van software of producten. Een user story bestaat uit enkele zinnen gewone spreektaal van de (computer)gebruiker waarin staat wat de gebruiker doet...",
      "readTime": 1,
      "lastRevised": "2021-01-18",
      "link": "?a=User story",
      "links": [],
      "edits": []
    },
    {
      "title": "CMD Method Pack",
      "headCategory": "Advies",
      "subCategory": "Gebruikersinteractie",
      "author": {
        "fullName": "Ruben van den Brink",
        "link": "hogeschool-utrecht",
        "organization": "Hogeschool Utrecht"
      },
      "text": "<h2>Onderwerp (what)</h2><div>Door de opleiding Communication en Multimedia Design (CMD) is een website gemaakt met daarin de belangrijkste methodieken en technieken die in deze opleiding worden gebruikt.</div><div><br></div><h2>Doel (why)</h2><div>Hierdoor kun je snel zoeken in technieken en methoden die je kunt gebruiken in alle fases van de gebruikersinteractie. Is daardoor heel geschikt als bibliotheek voor dit soort kennis.</div><div><br></div><h2>Beschrijving (how)</h2><div>Ga naar de website van <a href=\"https://cmdmethods.nl/\">CMD Method Pack</a> en vindt de techniek of methode die je kan helpen bij het oplossen van diverse vraagstukken op het terrein van de gebruikersinteractie.&nbsp;</div><div><br></div><h2>Rol</h2><div><ul><li>Front-end developer</li><li>UX designer<br></li></ul></div><h2></h2>",
      "description": "Onderwerp (what)Door de opleiding Communication en Multimedia Design (CMD) is een website gemaakt met daarin de belangrijkste methodieken en technieken die in deze opleiding worden gebruikt.Doel (why)Hierdoor kun je snel zoeken in technieken en methoden die je kunt gebruiken in alle fases van de geb...",
      "readTime": 1,
      "lastRevised": "2021-01-08",
      "link": "?a=CMD Method Pack",
      "links": [],
      "edits": []
    },
    {
      "title": "Design Thinking Methode",
      "headCategory": "Ontwerp",
      "subCategory": "Gebruikersinteractie",
      "author": {
        "fullName": "Ruben van den Brink",
        "link": "hogeschool-utrecht",
        "organization": "Hogeschool Utrecht"
      },
      "text": "<h2>Onderwerp (what)</h2><div>Design Thinking zet de eindgebruiker centraal in het ontwerpen van business innovaties. Het zoekt naar de beste oplossing tussen de wensen van eindgebruikers (desirability), de mogelijkheden van technologie (feasibility) en de wijze waarop geld verdient (viability) kan worden met de innovatie.<br></div><h2>Doel (why)</h2><div><div>Veel van de nieuwe innovaties betreffen het oplossen van complexe problemen die we nog niet eerder hebben opgelost. Daarom zijn er geen goede best practices beschikbaar en is er een goede methode van 'trial en error' noodzakelijk.&nbsp;</div></div><div><br></div><h2>Beschrijving (how)</h2><div><div>Design Thinking gaat over het algemeen uit van 5 fasen in het innovatie proces die zeker niet lineair worden doorlopen. Deze fases zijn:</div><div><ol><li>Empatize (leer de gebruiker diepgaand kennen)</li><li>Define (stel een scherpe vraagstelling op)</li><li>Ideate (bedenk zo veel mogelijk ideeën en kies het beste idee)</li><li>Prototype&nbsp; (maak zo snel mogelijk een toonbaar prototype)</li><li>Test (test en prototype uit bij de eindgebruikers en leer van de feedback)</li></ol></div><div>Wanneer je voorbeelden van het proces van design thinking bekijkt zie je veelal op deze 5 fasen gebaseerde methoden. De laatste jaren zijn er veel aanpassingen op gemaakt. Maar laat je niet afschrikken. In de basis zie je bovenstaande fasen altijd weer terug</div></div><div><br></div><h3>Beginnerscontent</h3><div>In <a href=\"https://youtu.be/ldYzbV0NDp8\">deze video</a> zie je een uitleg van IDEO. Dit is de organisatie die de geestelijk vader is van deze benadering.</div><div><br></div><div>In de <a href=\"https://youtu.be/-ySx-S5FcCI\">volgende video</a>&nbsp;wordt een hele goede uitleg gegeven over het proces van design thinking.</div><div><br></div><h3>Gevorderden</h3><div>Een mooi voorbeeld van een compleet uitgewerkt vindt je <a href=\"https://willhepworth.co/spotify-groups\">hier</a>.</div><h2>Rol</h2><div><ul><li>Front-end developer</li><li>UX designer<br></li></ul></div><h2></h2>",
      "description": "Onderwerp (what)Design Thinking zet de eindgebruiker centraal in het ontwerpen van business innovaties. Het zoekt naar de beste oplossing tussen de wensen van eindgebruikers (desirability), de mogelijkheden van technologie (feasibility) en de wijze waarop geld verdient (viability) kan worden met de ...",
      "readTime": 1,
      "lastRevised": "2021-01-08",
      "link": "?a=Design Thinking Methode",
      "links": [],
      "edits": []
    },
    {
      "title": "Design Sprint",
      "headCategory": "Ontwerp",
      "subCategory": "Gebruikersinteractie",
      "author": {
        "fullName": "Ruben van den Brink",
        "link": "hogeschool-utrecht",
        "organization": "Hogeschool Utrecht"
      },
      "text": "<h2>Onderwerp (what)</h2><div>Design Sprint of Sprint 0.</div><div><h2>Doel (why)</h2></div><div><div>De Design Sprint (2.0) is een vier- of vijfdaagse workshop die door steeds meer organisaties wordt toegepast om sneller tot innovatie te komen. De Design Sprint is een (team)proces voor het snel en goedkoop ontwikkelen van ideeën en deze te valideren door prototypen te testen met echte klanten. Na de design sprint kan gestart worden met de uitvoerende sprints. Belangrijke uitkomst van&nbsp; de design sprint zijn de eerste user stories voor de backlog.</div></div><h2>Beschrijving (how)</h2><div><div>In een 4 daagse workshop kan bijvoorbeeld de volgende&nbsp; stappen worden doorlopen.</div><div><br></div><div><ul><li><b>Dag 1: Probleem.</b> Breng het probleem in kaart en kies een belangrijk gebied om op te focussen qua oplossing</li><li><b>Dag 2: Oplossing en besluitvorming.</b> Brainstorm en schets mogelijke oplossingen op papier. Kies het idee met de meeste potentie en maak een <a href=\"https://agilescrumgroup.nl/storyboards-liberating-structure/?preview=true\">storyboard </a>(Koppelingen naar een externe site.) waarmee de werking van het idee wordt geduid</li><li><b>Dag 3: Prototype.</b> Zet als team een prototype in elkaar dat voldoende realistisch is om te kunnen testen met echte gebruikers</li><li><b>Dag 4: Test.</b> Test live met echte gebruikers om de oplossing te valideren.</li></ul></div></div><h2>Rol</h2><div>Alle teamleden</div><h2></h2>",
      "description": "Onderwerp (what)Design Sprint of Sprint 0.Doel (why)De Design Sprint (2.0) is een vier- of vijfdaagse workshop die door steeds meer organisaties wordt toegepast om sneller tot innovatie te komen. De Design Sprint is een (team)proces voor het snel en goedkoop ontwikkelen van ideeën en deze te valider...",
      "readTime": 1,
      "lastRevised": "2021-01-08",
      "link": "?a=Design Sprint",
      "links": [],
      "edits": []
    },
    {
      "title": "Value Proposition Canvas (VPC)",
      "headCategory": "Analyse",
      "subCategory": "Bebruikersinteractie",
      "author": {
        "fullName": "Ruben van den Brink",
        "link": "hogeschool-utrecht",
        "organization": "Hogeschool Utrecht"
      },
      "text": "<h2>Onderwerp (what)</h2><div><span style=\"color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">VPC is een instrument om een product visie te ontwerpen op basis van de belangrijkste wensen van een doelgroep en deze te vertalen naar een product/dienst</span><br></div><div><h2>Doel (why)</h2></div><div><div>Wordt onder andere toegepast voor het definieren van een product visie</div></div><h2>Beschrijving (how)</h2><div>Model waarin je eerst vanuit de gebruiker kijkt welke taken die moet verrichten, die je met een slimme it oplossing (app, iot, ai, etc) wilt verbeteren. je kijkt daarbij naar de pijn die gebruikers nu ervaren in het verrichten van die taak (bijvoorbeeld het boeken van een mooie klimvakantie) en welke extra gains (voordelen) je kunt bedenken om de gebruiker bij die taak nog extra te ondersteunen. Vanuit de gains en pains bedenk je dan een IT oplossing die daar antwoord op moet geven. Is een heel goed brainstorm model om mee te starten en productideeen mee uit te werken. Wordt veel door start-ups gebruikt.<br></div><div><br></div><h3>Beginnerscontent</h3><div><a href=\"https://www.strategyzer.com/canvas/value-proposition-canvas\">https://www.strategyzer.com/canvas/value-proposition-canvas</a><br></div><h2>Rol</h2><div><ul><li>Front-end developer</li><li>UX designer</li></ul></div><h2></h2>",
      "description": "Onderwerp (what)VPC is een instrument om een product visie te ontwerpen op basis van de belangrijkste wensen van een doelgroep en deze te vertalen naar een product/dienst. Doel (why)Wordt onder andere toegepast voor het definieren van een product visie. Beschrijving (how)Model waarin je eerst vanuit...",
      "readTime": 1,
      "lastRevised": "2021-01-08",
      "link": "?a=Value Proposition Canvas (VPC)",
      "links": [],
      "edits": []
    },
    {
      "title": "Persona's",
      "headCategory": "Analyse",
      "subCategory": "Gebruikersinteractie",
      "author": {
        "fullName": "Ruben van den Brink",
        "link": "hogeschool-utrecht",
        "organization": "Hogeschool Utrecht"
      },
      "text": "<h2>Onderwerp (what)</h2><div><div><font color=\"#2d3b45\" face=\"Lato Extended, Lato, Helvetica Neue, Helvetica, Arial, sans-serif\">Een persona staat als voorbeeld voor een bepaalde groep die het te ontwerpen product moeten gaan gebruiken en/of er door geraakt worden. Hierbij moet je niet alleen denken aan directe, maar ook aan indirecte gebruikers. Deze persona bevat niet alleen tekst, maar ook visuele elementen.</font></div></div><div><h2>Doel (why)</h2></div><div><div>Door een persona (grafisch) te verbeelden en te beschrijven hebben alle specialisten in het team een goed beeld van de gebruikers waarvoor het product wordt ontworpen.</div><div><br></div><div>Door een bredere groep van persona’s te maken kan je beter rekening houden met de betrokkenheid van die persona’s bij het ontwerpproces en van de impact die het product kan hebben op deze persona’s. Door expliciet zaken als gender, etniciteit en (lage) inkomen en tevens waarden van persona’s mee te nemen is er minder kans mensen onbedoeld uit te sluiten.Beschrijving (how)<br></div></div><div>Model waarin je eerst vanuit de gebruiker kijkt welke taken die moet verrichten, die je met een slimme it oplossing (app, iot, ai, etc) wilt verbeteren. je kijkt daarbij naar de pijn die gebruikers nu ervaren in het verrichten van die taak (bijvoorbeeld het boeken van een mooie klimvakantie) en welke extra gains (voordelen) je kunt bedenken om de gebruiker bij die taak nog extra te ondersteunen. Vanuit de gains en pains bedenk je dan een IT oplossing die daar antwoord op moet geven. Is een heel goed brainstorm model om mee te starten en productideeen mee uit te werken. Wordt veel door start-ups gebruikt.<br></div><div><br></div><h2>Beschrijving (how)</h2><div><p style=\"margin: 12px 0px; color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">Afhankelijk hoeveel tijd en geld je hebt zal je meer of minder onderzoek doen bij met maken van een persona. Als basis van een persona is het goed om een stakeholderanalyse te nemen, dan weet je al uit welke stakeholders je kan kiezen. Het meest simpele is een ah-hoc of proto persona, de meest ingewikkelde is statische persona. Dit onderscheid en aanpak wordt duidelijk gemaakt in dit artikel:&nbsp;<a href=\"https://www.nngroup.com/articles/persona-types/\">https://www.nngroup.com/articles/persona-types/</a>.</p><p style=\"margin: 12px 0px; color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">Belangrijk bij het maken van deze persona’s is dat je bij de keuze van persona's goed nadenkt over diversiteit, gebruik je bijvoorbeeld alleen rijke blanke hetero mannen of een veel breder scala? Daarnaast is het goed om verder te kijken dan alleen de directe gebruikers. Bij voorbeelden staat dit verder uitgewerkt.</p><h3 style=\"margin: 12px 0px; color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">Beginnerscontent</h3></div><div><span style=\"color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">Een introductie video dat onder andere waarschuwt voor het gebruik van stereotypes: <a href=\"https://www.youtube.com/watch?v=GNvLpfXCge8\">About personas and how to create them.</a></span><a href=\"https://www.youtube.com/watch?v=GNvLpfXCge8\"><br></a></div><div><span style=\"color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\"><br></span></div><div><span style=\"color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">Verschillende type persona's en de aanpak:&nbsp;</span><font color=\"#2d3b45\" face=\"Lato Extended, Lato, Helvetica Neue, Helvetica, Arial, sans-serif\"><a href=\"https://www.nngroup.com/articles/persona-types/\">https://www.nngroup.com/articles/persona-types/</a>.&nbsp;Let op dat de voorbeelden hier genoemd het niet hebben over waarden, dit is wel belangrijk om mee te nemen, zie ook de voorbeelden hieronder bij Goede voorbeelden.</font></div><div><font color=\"#2d3b45\" face=\"Lato Extended, Lato, Helvetica Neue, Helvetica, Arial, sans-serif\"><br></font></div><div><font color=\"#2d3b45\" face=\"Lato Extended, Lato, Helvetica Neue, Helvetica, Arial, sans-serif\">Voor meer informatie over de waarden die je opneemt bij je persona's:</font></div><div><font color=\"#2d3b45\" face=\"Lato Extended, Lato, Helvetica Neue, Helvetica, Arial, sans-serif\"><a href=\"https://www.kritischehouding.nl/2009/12/overzicht-positieve-waarden.html\">https://www.kritischehouding.nl/2009/12/overzicht-positieve-waarden.html</a><br></font></div><div><br></div><div><p style=\"margin: 12px 0px; color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">Voor het verschil tussen de customer segments die je in je SBMC gebruikt en persona’s:</p></div><div><a href=\"https://www.mightyroar.com/blog/segmentation-persona-development\">https://www.mightyroar.com/blog/segmentation-persona-development</a></div><div><br></div><h3>Gevorderden</h3><div><div>Diepgaandere informatie met onder andere de koppeling naar User Stories: <a href=\"https://www.frankwatching.com/archive/2009/04/01/hoe-personas-en-user-stories-bijdragen-aan-een-succesvol-designproces/\">Frank Watching (Koppelingen naar een externe site.) (Koppelingen naar een externe site.)</a></div><div><br></div><div>Een korte paper over persona’s: <a href=\"https://elephantcs.nl/wp-content/uploads/2020/02/Personas-whitepaper-l-digitaal-bureau-Elephant.pdf\r\nRol\">https://elephantcs.nl/wp-content/uploads/2020/02/Personas-whitepaper-l-digitaal-bureau-Elephant.pdf</a></div></div><div><br></div><h2>Goede voorbeelden</h2><div><div>Stel je gaat een social media platform ontwikkelen voor jongeren. Een persona van een jongere ligt dan voor hand, maar als je wat verder kijkt dan maak je er ook één van zijn vader die geraakt wordt doordat het platform de stemming van zijn kind beïnvloed.</div><div><br></div><div>Wellicht ben je geneigd om een persona te kiezen die op jou lijkt, maar je kan ook breder kijken en bijvoorbeeld iemand kiezen met een andere gezinssamenstelling (een ouder gezin) of een andere etnische achtergrond.</div><div><br></div><div>Zoals bij de content pagina’s staat zal een persona aspecten bevatten als motivatie, persoonlijkheidskenmerken en frustraties, maar het is ook goed om&nbsp; waarden toe te voegen en waardenspanningen. Wat iemand waardevol vindt zal voor een groot gedeelte zijn/haar/hen gedrag bepalen. Voor de vader van het social media platform zouden verantwoordelijkheid, vertrouwen en veiligheid waarden kunnen zijn.&nbsp; Het kind zou wellicht verantwoordelijkheid, vertrouwen, autonomie en sociale acceptatie bij haar vrienden belangrijk vinden. Waardespanningen kunnen bij de vader liggen tussen het willen stimuleren van vertrouwen&nbsp; en veiligheid, de dochter tussen vertrouwen vinden bij de vader en sociale acceptatie. Tussen hun kan er wrijving ontstaan tussen de vaders bezorgdheid over veiligheid en de dochter haar behoefte aan autonomie.</div><div><br></div><div>Bij het ontwerpen van het platform kan hiermee rekening worden gehouden. Door bijvoorbeeld te zorgen dat er een goede check zit op leeftijd van de deelnemers van het platform en dat er een moderator op zit die slechte posts verwijderd, maar ook dat niet een ouder zomaar kan meelezen met de berichten van het kind.&nbsp;&nbsp;</div><div><br></div><div>Wat visueler kunnen de twee persona’s er bijvoorbeeld zo uitzien:</div></div><div><img src=\"https://canvas.hu.nl/courses/12085/files/1132872/download?wrap=1\"><br></div><div><br></div><div><img src=\"https://canvas.hu.nl/courses/12085/files/1132875/download?wrap=1\"><br></div><div><br></div><div><p style=\"margin: 12px 0px; color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">Een iets uitgebreidere van iemand die een slim winkelcentrum (smart mall) bezoekt:</p></div><div><img src=\"https://canvas.hu.nl/courses/12085/files/1152151/download?wrap=1\"><br></div><h2>Rol</h2><div><ul><li>Front-end developer</li><li>UX designer</li></ul></div><h2></h2>",
      "description": "Onderwerp (what)Een persona staat als voorbeeld voor een bepaalde groep die het te ontwerpen product moeten gaan gebruiken en/of er door geraakt worden. Hierbij moet je niet alleen denken aan directe, maar ook aan indirecte gebruikers. Deze persona bevat niet alleen tekst, maar ook visuele elementen...",
      "readTime": 3,
      "lastRevised": "2021-01-08",
      "link": "?a=Persona's",
      "links": [],
      "edits": []
    },
    {
      "title": "Vaststellen van Business Modellen (SBMC)",
      "headCategory": "Analyse",
      "subCategory": "Organisatie Processen",
      "author": {
        "fullName": "Ruben van den Brink",
        "link": "hogeschool-utrecht",
        "organization": "Hogeschool Utrecht"
      },
      "text": "<h2>Onderwerp (what)</h2><div>Sustainable Business Model Canvas (SBMC)</div><div><br></div><h2>Beschrijving (how)</h2><div><div>Probeer per blokje te achterhalen door deskresearch en interviews hoe dat zit voor de casus/opdracht waarover het gaat en geef dwarsverbanden/relaties aan. Bij elke bouwsteen staan een aantal vragen om je helpen de bouwsteen in te vullen. Voordat je een business model maakt is het goed om eerst vooronderzoek te doen. Denk bijvoorbeeld aan het maken van een <a href=\"https://nl.wikipedia.org/wiki/Sterkte-zwakteanalyse\">SWOT-analyse</a> (Koppelingen naar een externe site.) en het nagaan wat de missie, visie en waarden van een organisatie zijn.&nbsp;</div><div><br></div><div>De <a href=\"https://www.case-ka.eu/wp/wp-content/uploads/2017/05/SustainableBusinessModelCanvas_highresolution.jpg\">SBMC</a>&nbsp;ziet er als volgt uit:</div><div><img src=\"https://canvas.hu.nl/courses/12085/files/1133191/download?wrap=1\"><br></div><div><br></div><div>Hoe je de bovenste negen bouwstenen moet invullen staat op vele websites, zie ook beginners- en gevorderdencontent.</div><div><br></div><div>Je doorloopt drie stappen voor de tweede onderste bouwstenen:</div><div><ul><li>Je verkrijgt informatie over de ecologische en sociale nadelen en voordelen van de organisatie. Dit kan via deskresearch, interview en door te brainstormen in je projectteam.</li><li>Je beantwoordt de vragen die in de bouwstenen staan.</li><li>Je maakt de balans op en je kijkt welke veranderingen er mogelijk zijn om de sociale en ecologische balans in de goede richting te sturen.</li></ul><h3>Beginnerscontent</h3><div>In <a href=\"https://www.youtube.com/watch?v=gVimMEI2u2w\">deze</a> video wordt uitgelegd hoe je succesvol een SBMC maakt.</div><div><br></div><div><a href=\"https://www.youtube.com/watch?v=iA5MVUNkSkM&amp;feature=youtu.be\">Prototyping</a></div><div><br></div><div><a href=\"https://youtu.be/MOkRHVlgNtM\">Alexander Osterwalder: Sketching Out a Business Model</a></div><div><br></div><h3>Gevorderden</h3><div><div><a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.471.9178&amp;rep=rep1&amp;type=pdf\">Osterwalder, A.,&nbsp; &amp; Peigner, Y. (2010). Business Model Generation. John Wiley.</a></div></div><div><br></div><div>Het Triple Layered Canvas biedt een duurzame business model canvas aan dat nog veel dieper gaat dan het BBMC. Dit is meer werk, maar zorgt ook voor een betere analyse.</div><div><br></div><div>Een video met een toelichting op het Triple Layered BMC:</div><div><br></div><div><a href=\"https://youtu.be/DpnbqBD8bVA\">5.2 dr. Steve Kennedy: Triple layered business model canvas</a></div><div><br></div><div><span style=\"color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">Joyce, Alexandre &amp; Paquin, Raymond. (2016). The triple layered business model canvas: A tool to design more sustainable business models. Journal of Cleaner Production. 135. 10.1016/j.jclepro.2016.06.067. The triple layered business model canvas: A tool to design more sustainable business models</span><br></div><div><br></div><div><a href=\"https://www.researchgate.net/publication/304026101_The_triple_layered_business_model_canvas_A_tool_to_design_more_sustainable_business_models\">https://www.researchgate.net/publication/304026101_The_triple_layered_business_model_canvas_A_tool_to_design_more_sustainable_business_models</a><br></div><div><br></div><div><span style=\"color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">Y. Kwak, J. S. Kim, S. T. Lee and G. Y. Gim, \"A Study on The Sustainable Value Generation of Mobile Messenger Service Using ‘Triple Layered Business Model Canvas’,\"&nbsp;</span><em style=\"color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">2019 20th IEEE/ACIS International Conference on Software Engineering, Artificial Intelligence, Networking and Parallel/Distributed Computing (SNPD)</em><span style=\"color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\">, Toyama, Japan, 2019, pp. 340-350, doi: 10.1109/SNPD.2019.8935777</span><br></div><div><span style=\"color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\"><br></span></div><h3><font color=\"#2d3b45\" face=\"Lato Extended, Lato, Helvetica Neue, Helvetica, Arial, sans-serif\"><span style=\"font-size: 16px; background-color: rgb(255, 255, 255);\">Goede voorbeelden</span></font></h3><div><font color=\"#2d3b45\" face=\"Lato Extended, Lato, Helvetica Neue, Helvetica, Arial, sans-serif\"><span style=\"background-color: rgb(255, 255, 255);\">Hieronder staat een Business Model Canvas van Booking.com (<a href=\"https://innovationtactics.com/wp-content/uploads/2017/12/Business-model-canvas-booking-com.png\">https://innovationtactics.com/wp-content/uploads/2017/12/Business-model-canvas-booking-com.png</a>)<br></span></font></div><div><img src=\"https://canvas.hu.nl/courses/12085/files/1133195/download?wrap=1\"><font color=\"#2d3b45\" face=\"Lato Extended, Lato, Helvetica Neue, Helvetica, Arial, sans-serif\"><span style=\"background-color: rgb(255, 255, 255);\"><br></span></font></div><div><br></div><div>Zoals je kan zien staat hier nog geen informatie over de eco-social costst en de eco-social benefits.</div><div><br></div><div><b>Stap 1</b>&nbsp;is het opzoeken van de informatie over deze aspecten. Dat kan je doen via zoekvragen als:<br></div><div><ul><li>Downsides/nadelen Booking.com</li><li>Risks/risico's Booking.com</li><li>Dangers/gevaren Booking.com</li><li>Societal costs/maatschappelijke kosten Booking.com</li><li>Sustainability/duurzaamheid en Booking.com</li></ul><div>Dan vind je bijvoorbeeld een redelijke bron van wikipedia: <a href=\"https://en.wikipedia.org/wiki/Booking.com#Controversies_and_criticism\">https://en.wikipedia.org/wiki/Booking.com#Controversies_and_criticism</a>. Ook hebben ze zelf een Corporate Social Sustainability report waar voordelen in staan:&nbsp;<a href=\"https://www.bookingholdings.com/wp-content/uploads/2020/04/BKNG_CR2019-1.pdf\">https://www.bookingholdings.com/wp-content/uploads/2020/04/BKNG_CR2019-1.pdf</a></div></div><div><br></div><div>Bij <b>stap 2</b>&nbsp;ghebruik je die informatie om de twee bouwstenen met de vragen in te vullen.</div><div><br></div><div><i>Vragen eco-social costs</i></div><div><i><br></i></div><div><div style=\"\">Welke sociale en ecologische kosten/schade veroorzaakt ons business model? Wie heeft daar last van? Zijn dat potentiële Key Partners?</div><div style=\"\"><ul><li>Welke Key Resources zijn niet hernieuwbaar?</li><li>Welke Key Activities gebruiken veel hulpbronnen/grondstoffen/materialen?</li></ul></div><div style=\"\">Sociale kosten:</div><div style=\"\"><ul><li>Uitbuiting van afhankelijke positie hotels.</li></ul></div><div style=\"\"><i>Toelichting:</i> Booking.com is zeer dominant in de markt en kan daardoor forse tarieven vragen aan hotels om op hun site te staan. Tevens kunnen ze vragen aan hotels om bijv. hun voorwaarden of prijzen af te stemmen op wat Booking.com wil. Hotels hebben nauwelijks een andere optie, ze worden via hun eigen site niet of slecht gevonden.</div><div style=\"\"><ul><li>Verleiding tot meer/anders consumeren door reizigers</li></ul></div><div style=\"\"><i>Toelichting:</i> Booking.com gebruikt verschillende (onbewuste) beïnvloedingstechnieken op de site om de bezoeker te verleiden om sneller en meer te boeken. Hierbij is het vraag of de bezoekers daardoor niet dingen doen tegen hun eigen belang in.</div><div style=\"\"><ul><li>Verminderde concurrentie door machtige positie</li></ul></div><div style=\"\"><i>Toelichting:</i> Booking.com is zo groot dat ze het heel moeilijk maken voor nieuwe concurrenten om de markt te betreden. Eerdere bestaande concurrenten zijn al weg of kunnen niet meekomen. Dit zorgt voor een ongezonde markt waarbij Booking.com veel kan bepalen.</div><div style=\"\"><br></div><div style=\"\">Ecologische kosten:</div><div style=\"\"><ul><li>Groot volume dataverkeer: hoge CO2 uitstoot, veel grondstoffen</li></ul></div><div style=\"\"><i>Toelichting:</i> Booking.com gebruikt veel data, dit wordt niet beheerd in CO2 neutrale datacentra. Tevens is het onbekend wat hun datacentrum (Unica) doet aan cradle to cradle gebruiken van hardware.&nbsp;</div><div style=\"\"><ul><li>Meer en verder reizen door groter gemak: hoge CO2 uitstoot, verlies biodiversiteit</li></ul></div><div style=\"\"><i>Toelichting:</i> Booking.com maakt het heel makkelijk om reizen&nbsp; te boeken naar waar dan ook ter wereld. Dit kan ervoor zorgen dat er meer gereisd wordt (hogere CO2) en dat er meer mensen op meer plekken komen (verlies biodiversiteit). Op dit moment is het onduidelijk welke accommodaties echt duurzaam zijn.</div><div style=\"\"><br></div><div style=\"\">&nbsp;Vragen eco-social benefits</div><div style=\"\"><br></div><div style=\"\">-Welke sociale en ecologische voordelen veroorzaakt ons business model?</div><div style=\"\"><br></div><div style=\"\">-Wie zijn degene aan wie deze voordelen toekomen? Zijn dat potentiële klanten?</div><div style=\"\"><br></div><div style=\"\">-Kunnen we deze voordelen omzetten in een waarde propositie en zo ja hoe voor wie?</div><div style=\"\"><br></div><div style=\"\">Sociale voordelen</div><div style=\"\"><ul><li>Vrijwilligerswerk en donaties, beurzen</li></ul></div><div style=\"\"><i>Toelichting:</i> volgens hun jaarverslag doneren ze aan verschillende goede doelen en doen ook redelijk wat vrijwilligerswerk.</div><div style=\"\"><ul><li>Divers werknemersbestand</li></ul></div><div style=\"\"><i>Toelichting:</i>&nbsp; volgens hun jaarverslag hebben ze een heel divers medewerkersbestand. De vraag is wel hoe belangrijk dit is, ze hebben niet heel veel medewerkers.&nbsp;</div><div style=\"\"><ul><li>Grotere doelgroep kleine accommodaties: meer werkgelegenheid</li></ul></div><div style=\"\"><i>Toelichting:</i> voorheen wat het erg moeilijk om als kleine accommodatie gevonden te worden over de hele wereld, nu kan dat via Booking redelijk makkelijk (wel tegen kosten). Dit kan de lokale economie en werkgelegenheid stimuleren.</div><div style=\"\"><br></div><div style=\"\">Ecologische voordelen</div><div style=\"\"><br></div><div style=\"\">Booking zegt te werken aan een methode waarmee het makkelijk is om je als accommodatie te profileren op duurzame aspecten. Dit is er echter nog niet. Ze zeggen ook nog wat over duurzaamheid in hun eigen bedrijfsvoering, maar dat is nauwelijks relevant gezien dat de totale impact van de organisatie bijna uitsluitend ligt bij de accommodaties die meedoen aan het platform.</div><div style=\"\"><br></div><div style=\"\">Bij <b>stap 3</b> kijk je tenslotte naar wat er mogelijk is het business model om de balans beter te maken, meer sociale en ecologische voordelen, minder nadelen.</div><div style=\"\"><br></div><div style=\"\">Als je kijkt naar de huidige balans dan zijn de kosten groter dan de voordelen:</div></div><div style=\"\"><br></div><div style=\"\"><b>Eco-Social Costs</b></div><div style=\"\"><ol><li>Uitbuiting van afhankelijke positie hotels.</li><li>Verleiding tot meer/anders consumeren door reizigers.</li><li>Verminderde concurrentie door machtige positie.</li><li>Groot volume dataverkeer: hoge CO2 uitstoot, veel grondstoffen.</li><li><b>Meer en verder reizen door groter gemak: hoge CO2 uitstoot, verlies biodiversiteit (grootste factor)</b></li></ol><div><b><br></b></div><div><b>Eco-Social Benefits</b></div><div><ol><li>Vrijwilligerswerk en donaties, beurzen</li><li>Divers werkenemersbestand</li><li>Grotere doelgroep kleine accommodaties: meer werkgelegenheid</li></ol><div><div>Dit betekent dat Booking.com de maatschappij meer kost dan het oplevert met name als het aankomt op negatieve ecologische impact. Booking kan hier verschillende dingen aan doen in haar business model, bijvoorbeeld (met wat mogelijke consequenties):</div><div><br></div><div><ul><li>Accommodaties die duurzamer zijn belonen door bijv. kortingen te geven of hoger op de zoekpagina te zetten. Goed voor duurzame klantsegment. Slecht voor onduurzaam klantsegment.</li><li>Focus op lokaal. Dus de site zo inrichten dat deze voornamelijk suggesties geeft voor reizen dicht in de buurt (liefst zonder te vliegen) en hoe verder weg hoe moeilijker te vinden/in verhouding hoe duurder. Potentieel nadeel hiervan is dat de armste landen hierdoor economisch getroffen worden. Dus ecologisch goed, sociaal waarschijnlijk minder.</li><li>Weghalen van verleidende tactieken op de website zodat consumenten bewuster kunnen kiezen. Dit zorgt waarschijnlijk wel voor minder bestedingen.</li></ul></div><div>Dit zijn natuurlijk wel ingrepen die ook impact hebben op hun winst, de vraag is of Booking dat wil en kan doen op dit moment. Het beste is om bij het begin van een organisatie deze zaken mee te nemen. Een SBMC van een nieuwe Booking.com, waarbij het grootste nadeel wordt weggenomen, kan er bijvoorbeeld zo uitzien:</div></div></div><div><br></div><div><img src=\"https://dol-it.nl/assets/billy-images/SBMC-table.png\"><br></div></div><h2>Rol</h2></div><div><ul><li>Product-Owner</li><li>Business Analist</li></ul><div><br></div></div><div><br></div><div><br></div></div>",
      "description": "Onderwerp (what)Sustainable Business Model Canvas (SBMC)Beschrijving (how)Probeer per blokje te achterhalen door deskresearch en interviews hoe dat zit voor de casus/opdracht waarover het gaat en geef dwarsverbanden/relaties aan. Bij elke bouwsteen staan een aantal vragen om je helpen de bouwsteen i...",
      "readTime": 5,
      "lastRevised": "2021-01-08",
      "link": "?a=Vaststellen van Business Modellen (SBMC)",
      "links": [],
      "edits": []
    },
    {
      "title": "Prototype",
      "headCategory": "Ontwerp",
      "subCategory": "Gebruikersinteractie",
      "author": {
        "fullName": "Ruben van den Brink",
        "link": "hogeschool-utrecht",
        "organization": "Hogeschool Utrecht"
      },
      "text": "<h2>Onderwerp (what)</h2><div>Een incomplete/vroege/test versie van een product of dienst in ontwikkeling. Voor ICTers kan je onderscheid maken tussen prototypes gericht op alleen software en prototypes die ook hardware gebruiken. Prototypes kunnen heel simpel en snel gemaakt worden of veel uitgebreider en duurder.<br></div><div><br></div><h2>Doel (why)</h2><div>Met het prototype wil je uittesten of wat je bedacht hebt wel goed is voordat je er verder op gaat bouwen. Goed gaat dan vaak over usability, het ophalen van feedback van de eindgebruiker zodat je je ontwerp kan bijsturen. Deze feedback kan gaan over zaken als de functionaliteit en het ontwerp, maar ook over hoe waardes van gebruikers geraakt worden. Prototypes kunnen ook gebruikt worden om in een team duidelijkheid te krijgen over wat er gebouwd gaat worden.<br></div><div><br></div><h2>Beschrijving (how)</h2><div><div><b>Stap 1:</b> pak je persona’s, stakeholderanalyse, SBMC erbij en bekijk voor en met wie je de prototype precies gaat ontwerpen. Belangrijk hierbij is om niet alleen directe, maar ook indirecte gebruikers te betrekken.</div><div><br></div><div><b>Stap 2:</b> is het analyseren wat voor soort prototype je in dit stadium van ontwikkeling nodig hebt. Heb je alleen een papieren versie nodig (zie paper prototyping) of wil je een klickbare werkende versie testen (zie live prototyping). Of iets er tussen in? Over het algemeen zal je vroeg in je ontwerpcyclus voor simpel gaan en later voor complexer.</div><div><br></div><div><b>Stap 3:</b> het maken van het prototype of meerdere prototypes. Zoek per soort prototype op hoe je dat doet. Je kan er ook voor kiezen om samen met je gebruikers een prototype te maken (co-design). Zorg hierbij dat je niet alleen directe maar ook indirecte stakeholders meeneemt. Neem bijvoorbeeld ook mensen mee met een beperking of mensen in de sociale context.&nbsp; Je kan ook verschillende mogelijkheden voorleggen en dus verschillende prototypes maken.</div><div><br></div><div>Houd rekening met het maken van je prototype met de materialen die je gebruikt en wat je doet met die materialen bij afloop:</div></div><div><ol style=\"padding: 0px; margin: 0px 0px 6px 25px; color: rgb(45, 59, 69); font-family: &quot;Lato Extended&quot;, Lato, &quot;Helvetica Neue&quot;, Helvetica, Arial, sans-serif; font-size: 16px; background-color: rgb(255, 255, 255);\"><li>Bij de aanschaf van materialen: zorg dat je niet teveel materialen verkrijgt, zorg dag de materialen op een goede manier zijn geproduceerd (geen kinderhanden, geen ziekmakende stoffen). Kan je kiezen voor materialen die een lage milieu voetafdruk hebben ipv materialen die een grote voetafdruk hebben?</li><li>Bij het gebruik van de materialen en na afloop: kan je het prototype zo produceren dat de onderdelen na afloop weer hergebruikt kunnen worden voor andere protoypes? Niet solderen bijvoorbeeld, maar klikbare onderdelen gebruiken. Mochten ze niet hergebruikt kunnen worden, kunnen ze goed gerecycled worden (kunnen de onderdelen gescheiden worden)?</li></ol><div><font color=\"#2d3b45\" face=\"Lato Extended, Lato, Helvetica Neue, Helvetica, Arial, sans-serif\"><br></font></div></div><div><font color=\"#2d3b45\" face=\"Lato Extended, Lato, Helvetica Neue, Helvetica, Arial, sans-serif\"><div><b>Stap 4:</b> het opstellen van vragen die je wilt stellen, dit kan je ook weer samen doen met je (indirecte)gebruikers. Belangrijk hierbij is om niet alleen naar functionaliteit en design te vragen, maar ook hoe het nieuwe product/dienst raakt aan waarden die de stakeholders naar voren brengen, wat voor implicaties heeft deze dienst/product voor deze waarden?</div><div><br></div><div><b>Stap 5</b>: het testen van het prototype bij de gebruikers, informatie daarover vastleggen.</div><div><br></div><div><b>Stap 6:</b> is het aanpassen van je ontwerp op basis van de feedback. Vervolgens zal je in een volgend stadium weer verder gaan testen en bij stap 1 beginnen.</div><div><br></div><h3>Beginnerscontent</h3><div>Over software prototypes:&nbsp;<a href=\"https://en.wikipedia.org/wiki/Software_prototyping\">https://en.wikipedia.org/wiki/Software_prototyping</a></div><div><br></div><div><div>Expliciet over papieren prototypes: <a href=\"https://en.wikipedia.org/wiki/Paper_prototyping\">https://en.wikipedia.org/wiki/Paper_prototyping</a></div><div><br></div><div>Over live prototyping: <a href=\"https://www.researchgate.net/publication/303901737_Live_Prototyping\">https://www.researchgate.net/publication/303901737_Live_Prototyping</a></div></div><div><br></div><h3>Gevorderden</h3><div><div>Over hardware prototypes: <a href=\"https://www.outdesign.co/single-post/A-Guide-to-Prototyping-for-Hardware-Startups\">https://www.outdesign.co/single-post/A-Guide-to-Prototyping-for-Hardware-Startups</a></div><div><br></div><div>Een artikel over hoe je waarden meeneemt bij het ontwerp van een mobiele telefoon voor daklozen met voorbeelden erin:</div><div><br></div><div>Woelfer et. Al, Improving the safety of homeless young people with mobile phones: values, form and function, <a href=\"https://dl.acm.org/doi/proceedings/10.1145/1978942\">CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems</a>&nbsp;May 2011 Pages 1707–1716, <a href=\"https://doi.org/10.1145/1978942.1979191\">https://doi.org/10.1145/1978942.1979191</a> (log in via Hugo)</div></div><div><br></div><h3>Goede voorbeelden</h3><div>Een simpel voorbeeld van een papieren prototype:</div><div><br></div><div><a href=\"https://www.youtube.com/watch?v=y20E3qBmHpg\">https://www.youtube.com/watch?v=y20E3qBmHpg</a><br></div><h2>Rol</h2><div><ul><li>Front-end developer</li><li>UX designer</li></ul></div></font></div>",
      "description": "Onderwerp (what)Een incomplete/vroege/test versie van een product of dienst in ontwikkeling. Voor ICTers kan je onderscheid maken tussen prototypes gericht op alleen software en prototypes die ook hardware gebruiken. Prototypes kunnen heel simpel en snel gemaakt worden of veel uitgebreider en duurde...",
      "readTime": 3,
      "lastRevised": "2021-01-08",
      "link": "?a=Prototype",
      "links": [
        {
          "text": "Over software prototypes",
          "href": " https://en.wikipedia.org/wiki/Software_prototyping"
        },
        {
          "text": "Expliciet over papieren prototypes",
          "href": "https://en.wikipedia.org/wiki/Paper_prototyping"
        },
        {
          "text": "Live prototyping",
          "href": "https://www.researchgate.net/publication/303901737_Live_Prototyping"
        }
      ],
      "edits": []
    },
    {
      "title": "Wireframes",
      "headCategory": "Ontwerp",
      "subCategory": "Gebruikersinteractie",
      "author": {
        "fullName": "Ruben van den Brink",
        "link": "hogeschool-utrecht",
        "organization": "Hogeschool Utrecht"
      },
      "text": "<h2>Onderwerp (what)</h2><div>Achterhalen van problemen die gebruikers hebben met het ontwerp van je applicatie (website, mobiele applicatie of app), voordat deze in productie gaat.<br></div><div><br></div><h2>Doel (why)</h2><div>Wireframes worden gemaakt om alle elementen en functionaliteiten binnen een scherm een logische plek te geven zonder “afgeleid” te worden door visuele items. In wireframes ontbreekt het daarom ook (meestal) aan kleur, typografische stijl, fotografie, illustraties en focust daardoor op functie, gedrag en hiërarchie van content. Kortom het zwaartepunt ligt bij wat een scherm doet en niet hoe het eruit ziet (Bron: <a href=\"https://www.partout.nl/blog/wireframes-wat-en-waarom/\">Partout</a>)<br></div><div><br></div><h2>Beschrijving (how)</h2><div><div>Voordat je begint met het daadwerkelijk maken van een wireframe is het natuurlijk goed om eerst eens erbij te pakken voor wie je de website gaat maken, pak dus je persona’s erbij. Wat willen deze persona’s zien op de site? En wat is het doel van je site, welke actie wil je dat deze persona’s gaan ondernemen en hoe zorg je dat dit makkelijk wordt op jouw site? Nadat je dit helder hebt ga je pas tekenen.</div><div><br></div><div>Wireframes kun je met verschillende technieken maken. In volgorde van snelheid en kosten zijn dat schetsen op papier of bord, met een ontwerp tool of via live-prototyping in HTML (eventueel m.b.v. frameworks zoals Bootstrap).</div><div><br></div><div>Zorg dat bij het maken van wireframes dat er rekening gehouden wordt met de toegankelijkheid voor iedereen, ook voor mensen met een beperking zoals (kleuren)blindheid, doof of slechthorend, motorisch beperkt, zwakbegaafd of laaggeletterd. Zie de toegankelijkheidseisen hieronder bij beginnerscontent.</div></div><div><font color=\"#2d3b45\" face=\"Lato Extended, Lato, Helvetica Neue, Helvetica, Arial, sans-serif\"><div><br></div><h3>Beginnerscontent</h3><div>Introductievideo:<br></div><div><a href=\"https://youtu.be/8-vTd7GRk-w\">Wireframing for UX: What it is and how to get better at it</a></div><div><br></div><div>Toegankelijkheid en wireframes:<br><ul><li><a href=\"https://www.digitoegankelijk.nl/uitleg-van-eisen/vormgeving\">https://www.digitoegankelijk.nl/uitleg-van-eisen/vormgeving</a><br></li><li><a href=\"https://www.digitoegankelijk.nl/uitleg-van-eisen/navigatie\">https://www.digitoegankelijk.nl/uitleg-van-eisen/navigatie</a><br></li></ul></div><h3>Gevorderden</h3><div>Toegankelijkheid en wireframes verdieping:</div><div><div><ul><li><a href=\"https://www.slideshare.net/aidantierney/early-prevention-of-accessibility-issues-with-mockup-wireframe-reviews\">https://www.slideshare.net/aidantierney/early-prevention-of-accessibility-issues-with-mockup-wireframe-reviews&nbsp;</a></li><li><a href=\"https://ux.stackexchange.com/questions/41586/designing-wireframes-keeping-accessibility-guidelines-in-mind\">https://ux.stackexchange.com/questions/41586/designing-wireframes-keeping-accessibility-guidelines-in-mind&nbsp;</a></li><li><a href=\"https://www.bbc.co.uk/gel/guidelines/how-to-design-for-accessibility#annotating-wireframes-and-ux-designs\">https://www.bbc.co.uk/gel/guidelines/how-to-design-for-accessibility#annotating-wireframes-and-ux-designs</a></li></ul></div></div><div><br></div><h3>Goede voorbeelden</h3><div><div><span style=\"white-space:pre\">\t</span></div><div>In de slideshare bij gevorderdencontent staan voorbeelden van goede en minder goede wireframes.</div></div><h2>Rol</h2><div><ul><li>Front-end developer</li><li>UX designer</li></ul></div></font></div>",
      "description": "Onderwerp (what)Achterhalen van problemen die gebruikers hebben met het ontwerp van je applicatie (website, mobiele applicatie of app), voordat deze in productie gaat.Doel (why)Wireframes worden gemaakt om alle elementen en functionaliteiten binnen een scherm een logische plek te geven zonder “afgel...",
      "readTime": 2,
      "lastRevised": "2021-01-08",
      "link": "?a=Wireframes",
      "links": [
        {
          "text": "Persona's",
          "href": "https://wiki-billy.herokuapp.com/article?a=Persona%27s"
        }
      ],
      "edits": []
    },
    {
      "title": "Usability testing",
      "headCategory": "Realisatie",
      "subCategory": "Gebruikersinteractie",
      "author": {
        "fullName": "Ruben van den Brink",
        "link": "hogeschool-utrecht",
        "organization": "Hogeschool Utrecht"
      },
      "text": "<h2>Onderwerp (what)</h2><div>Achterhalen van problemen die gebruikers hebben met het ontwerp van je applicatie (website, mobiele applicatie of app), voordat deze in productie gaat.<br></div><h2>Doel (why)</h2><div>Zorgen dat de applicatie voor de gebruiker zo effectief, efficiënt en met de grootste tevredenheid kan werken<br></div><h2>Beschrijving (how)</h2><div><div>Er zijn veel verschillende methoden van usability testen. Er zijn ook diverse manieren om de methoden te categoriseren. Een mooie methode is naar:</div><div><ul><li>wat gebruikers zeggen versus doen en</li><li>quantitatief versus kwalitatief</li></ul></div><div>Door concept7 zijn de diverse methoden ondergebracht in 4 kwadranten volgens bovengenoemde categorisering.</div></div><div><br></div><div><img src=\"https://canvas.hu.nl/courses/12085/files/452991/download?wrap=1\"><br></div><h3>Beginnerscontent</h3><div>In het volgende <a href=\"https://dol-it.nl/assets/billy-files/Methodes%20van%20gebruikersonderzoek.pdf\">document</a> zijn de verschillende methoden volgens het model van concept7 uitgelegd.</div><div><br></div><div>Op de website van <a href=\"https://www.emerce.nl/best-practice/usabilitytesting-8-methoden-25-goedkope-online-tools\">emerce</a> worden 8 methoden toegelicht en zie je welke mogelijke tools je per methode zou kunnen gebruiken.<br><h3>Goede voorbeelden</h3></div><div><img src=\"https://canvas.hu.nl/courses/12085/files/269752/preview\"><br></div>",
      "description": "Onderwerp (what)Achterhalen van problemen die gebruikers hebben met het ontwerp van je applicatie (website, mobiele applicatie of app), voordat deze in productie gaat.Doel (why)Zorgen dat de applicatie voor de gebruiker zo effectief, efficiënt en met de grootste tevredenheid kan werken. Beschrijving...",
      "readTime": 1,
      "lastRevised": "2021-01-08",
      "link": "?a=Usability testing",
      "links": [
        {
          "text": "emence website",
          "href": "https://www.emerce.nl/best-practice/usabilitytesting-8-methoden-25-goedkope-online-tools"
        }
      ],
      "edits": []
    },
    {
      "title": "test",
      "headCategory": "Analyse",
      "subCategory": "Organisatie Processen",
      "author": {
        "fullName": "Jort Willemsen",
        "organization": "Universiteit Utrecht",
        "link": "universiteit-utrecht"
      },
      "text": "<div>test</div>",
      "description": "test",
      "readTime": 1,
      "lastRevised": "2021-01-18",
      "link": "?a=test",
      "links": [],
      "edits": []
    },
    {
      "title": "test2",
      "headCategory": "Realisatie",
      "subCategory": "Organisatie Processen",
      "author": {
        "fullName": "Xander Vedder",
        "organization": "Universiteit Utrecht",
        "link": "universiteit-utrecht"
      },
      "text": "<div>twawt</div>",
      "description": "twawt",
      "readTime": 1,
      "lastRevised": "2021-01-18",
      "link": "?a=test2",
      "links": [],
      "edits": []
    }
  ]
}
